/*
 *
 *
 *  Created on: May 14, 2020
 *      Author: Dev
 */

#ifndef __EXTERN_H_
#define __EXTERN_H_

#include "Globals.h"

/*-----------------------------------------------------------------------------
 * Глобальные переменные, используемые в разных модулях проекта
 *-----------------------------------------------------------------------------
 */

/* --- Основные статусы и буферы --- */
extern Statuses   Current_Status;         // Текущий статус системы
extern FILE      *FileBuffer;             // Указатель на файловый буфер (если используется)
extern uint8_t    BufferIsSet;            // Флаг установки буфера

/* --- UART --- */
extern uint8_t    uartTransmitBufferSize; // Размер буфера передачи по UART
extern uint8_t    uartTransmitBuffer[128];// Буфер передачи по UART

/* --- UART3 (DMA) --- */
extern UART_HandleTypeDef huart3;         // Дескриптор UART3 (DMA)
extern SPI_HandleTypeDef hspi1;

/*-----------------------------------------------------------------------------
 * Добавляйте сюда extern-переменные для других модулей по мере необходимости
 *-----------------------------------------------------------------------------
 */

#endif /* __EXTERN_H_ */
