#include "TargetTouch.h"
#include "stm32f4xx_hal_gpio_ex.h"
#include "stm32f4xx_ll_gpio.h"
#include "stm32f4xx_ll_exti.h"
// Статическая переменная для хранения состояния нажатия
 uint8_t isPressed = 0;

extern I2C_HandleTypeDef hi2c2;  // I2C порт для сенсорного экрана

//=============================================================================
// Инициализация сенсорного экрана
//=============================================================================
void TOUCH_Init(void) {
    // Инициализация контроллера ILI211X
    if (ILI211X_Init(hi2c2) == 0) {
        // Инициализация успешна
    } else {
        // Обработка ошибки инициализации, если необходимо
    }
}

//=============================================================================
// Проверка, нажата ли точка касания
//=============================================================================
uint8_t TOUCH_IsPressed(void) {
    return isPressed;  // Возвращает текущее состояние нажатия
}

//=============================================================================
// Установка состояния нажатия
//=============================================================================
void TOUCH_Set(void) {
    isPressed = 1;  // Устанавливает состояние нажатия в true
}

//=============================================================================
// Сброс состояния нажатия
//=============================================================================
void TOUCH_Reset(void) {
//     Сбрасывает состояние нажатия, если INT пин становится высоким
//    if (HAL_GPIO_ReadPin(INT_PORT, INT_PIN) == GPIO_PIN_SET) { // Проверяем состояние пина INT
        isPressed = 0;  // Сбрасывает состояние нажатия
//    }
}

//=============================================================================
// Получение данных о текущем касании
//=============================================================================
TOUCH_Data TOUCH_GetData(void) {
    TOUCH_Data td = {0, 0, 0};  // Инициализация структуры данных касания

    if (TOUCH_IsPressed()) { // Проверяем, нажата ли точка касания
        CTP_point_data cpd = ILI211X_ReadPoint(1);   // Чтение первой точки касания

        td.x = cpd.x;                // Получение координаты X
        td.y = cpd.y;                // Получение координаты Y
        td.z = cpd.z;
        td.id = cpd.id;                // касание
    }

    return td;                 // Возвращает данные касания
}



